milanbijeljac/UltrasonicMesure/Inc/stm32f072x8.h
/**
  ******************************************************************************
  * @file    stm32f0xx.h
  * @author  MCD Application Team
  * @version V1.3.0RC1
  * @date    27-September-2013
  * @brief   CMSIS Cortex-M0 Device Peripheral Access Layer Header File.
  *          This file contains all the peripheral register's definitions, bits
  *          definitions and memory mapping for STM32F0xx devices.
  *
  *          The file is the unique include file that the application programmer
  *          is using in the C source code, usually in main.c. This file contains:
  *           - Configuration section that allows to select:
  *              - The device used in the target application
  *              - To use or not the peripheralâ€™s drivers in application code(i.e.
  *                code will be based on direct access to peripheralâ€™s registers
  *                rather than drivers API), this option is controlled by
  *                "#define USE_STDPERIPH_DRIVER"
  *              - To change few application-specific parameters such as the HSE
  *                crystal frequency
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheralâ€™s registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f0xx
  * @{
  */

#ifndef __STM32F0XX_H
#define __STM32F0XX_H

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup Library_configuration_section
  * @{
  */

/* Uncomment the line below according to the target STM32F0 device used in your
   application
  */

#if !defined (STM32F030) && !defined (STM32F031) && !defined (STM32F051) && !defined (STM32F072)
  /* #define STM32F030 */   /*!<  */
  /* #define STM32F031 */   /*!<  */
  /* #define STM32F051 */   /*!<  */
  #define STM32F072   /*!<  */
#endif

/*  Tip: To avoid modifying this file each time you need to switch between these
        devices, you can define the device in your toolchain compiler preprocessor.
  */

#if defined (STM32F0XX_MD)
 #ifndef STM32F0XX
  /* Old STM32F0XX definition, maintained for legacy purpose */
  #define STM32F0XX    STM32F0XX_MD
 #endif /* STM32F0XX */
#endif /* STM32F0XX_MD */

#if defined (STM32F051)
 #ifndef STM32F0XX_MD
  /* Old STM32F0XX_MD definition, maintained for legacy purpose */
  #define STM32F0XX_MD    STM32F051
 #endif /* STM32F0XX_MD */
#endif /* STM32F051 */

#if defined (STM32F031)
 #ifndef STM32F0XX_LD
  /* Old STM32F0XX_LD definition, maintained for legacy purpose */
  #define STM32F0XX_LD    STM32F031
 #endif /* STM32F0XX_LD */
#endif /* STM32F031 */

#if defined (STM32F072)
 #ifndef STM32F0XX_HD
  /* Old STM32F0XX_HD definition, maintained for legacy purpose */
  #define STM32F0XX_HD    STM32F072
 #endif /* STM32F0XX_HD */
#endif /* STM32F072 */

#if defined (STM32F030)
 #if !defined (STM32F030X8) && !defined (STM32F030X6)
  /* Old STM32F030X6/X8 definition, maintained for legacy purpose */
  #define STM32F030X8    STM32F030
  #define STM32F030X6    STM32F030
 #endif /* STM32F030X8 or  STM32F030X6 */
#endif /* STM32F030 */

#if !defined (STM32F030) && !defined (STM32F031) && !defined (STM32F051) && !defined (STM32F072)
 #error "Please select first the target STM32F0xx device used in your application (in stm32f0xx.h file)"
#endif

#if !defined  USE_STDPERIPH_DRIVER
/**
 * @brief Comment the line below if you will not use the peripherals drivers.
   In this case, these drivers will not be included and the application code will
   be based on direct access to peripherals registers
   */
  /*#define USE_STDPERIPH_DRIVER*/
#endif /* USE_STDPERIPH_DRIVER */

/**
 * @brief In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.
  */
#if !defined  (HSE_VALUE)
#define HSE_VALUE    ((uint32_t)8000000) /*!< Value of the External oscillator in Hz*/
#endif /* HSE_VALUE */

/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value
   */
#if !defined  (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT   ((uint16_t)0x5000) /*!< Time out for HSE start up */
#endif /* HSE_STARTUP_TIMEOUT */

/**
 * @brief In the following line adjust the Internal High Speed oscillator (HSI) Startup
   Timeout value
   */
#if !defined  (HSI_STARTUP_TIMEOUT)
#define HSI_STARTUP_TIMEOUT   ((uint16_t)0x5000) /*!< Time out for HSI start up */
#endif /* HSI_STARTUP_TIMEOUT */

#if !defined  (HSI_VALUE)
#define HSI_VALUE  ((uint32_t)8000000) /*!< Value of the Internal High Speed oscillator in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI_VALUE */

#if !defined  (HSI14_VALUE)
#define HSI14_VALUE ((uint32_t)14000000) /*!< Value of the Internal High Speed oscillator for ADC in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI14_VALUE */

#if !defined  (HSI48_VALUE)
#define HSI48_VALUE ((uint32_t)48000000) /*!< Value of the Internal High Speed oscillator for USB in Hz.
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif /* HSI48_VALUE */

