milanbijeljac/UltrasonicMesure/Inc/stm32f072x8.h
/*******************  Bit definition for USART_ICR register  ******************/
#define  USART_ICR_PECF                      ((uint32_t)0x00000001)            /*!< Parity Error Clear Flag */
#define  USART_ICR_FECF                      ((uint32_t)0x00000002)            /*!< Framing Error Clear Flag */
#define  USART_ICR_NCF                      ((uint32_t)0x00000004)             /*!< Noise detected Clear Flag */
#define  USART_ICR_ORECF                     ((uint32_t)0x00000008)            /*!< OverRun Error Clear Flag */
#define  USART_ICR_IDLECF                    ((uint32_t)0x00000010)            /*!< IDLE line detected Clear Flag */
#define  USART_ICR_TCCF                      ((uint32_t)0x00000040)            /*!< Transmission Complete Clear Flag */
#define  USART_ICR_LBDCF                     ((uint32_t)0x00000100)            /*!< LIN Break Detection Clear Flag */
#define  USART_ICR_CTSCF                     ((uint32_t)0x00000200)            /*!< CTS Interrupt Clear Flag */
#define  USART_ICR_RTOCF                     ((uint32_t)0x00000800)            /*!< Receiver Time Out Clear Flag */
#define  USART_ICR_EOBCF                     ((uint32_t)0x00001000)            /*!< End Of Block Clear Flag */
#define  USART_ICR_CMCF                      ((uint32_t)0x00020000)            /*!< Character Match Clear Flag */
#define  USART_ICR_WUCF                      ((uint32_t)0x00100000)            /*!< Wake Up from stop mode Clear Flag */

/*******************  Bit definition for USART_RDR register  ******************/
#define  USART_RDR_RDR                       ((uint16_t)0x01FF)                /*!< RDR[8:0] bits (Receive Data value) */

/*******************  Bit definition for USART_TDR register  ******************/
#define  USART_TDR_TDR                       ((uint16_t)0x01FF)                /*!< TDR[8:0] bits (Transmit Data value) */

/******************************************************************************/
/*                                                                            */
/*                         Window WATCHDOG (WWDG)                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WWDG_CR register  ********************/
#define  WWDG_CR_T                           ((uint8_t)0x7F)               /*!< T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CR_T0                          ((uint8_t)0x01)               /*!< Bit 0 */
#define  WWDG_CR_T1                          ((uint8_t)0x02)               /*!< Bit 1 */
#define  WWDG_CR_T2                          ((uint8_t)0x04)               /*!< Bit 2 */
#define  WWDG_CR_T3                          ((uint8_t)0x08)               /*!< Bit 3 */
#define  WWDG_CR_T4                          ((uint8_t)0x10)               /*!< Bit 4 */
#define  WWDG_CR_T5                          ((uint8_t)0x20)               /*!< Bit 5 */
#define  WWDG_CR_T6                          ((uint8_t)0x40)               /*!< Bit 6 */

#define  WWDG_CR_WDGA                        ((uint8_t)0x80)               /*!< Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define  WWDG_CFR_W                          ((uint16_t)0x007F)            /*!< W[6:0] bits (7-bit window value) */
#define  WWDG_CFR_W0                         ((uint16_t)0x0001)            /*!< Bit 0 */
#define  WWDG_CFR_W1                         ((uint16_t)0x0002)            /*!< Bit 1 */
#define  WWDG_CFR_W2                         ((uint16_t)0x0004)            /*!< Bit 2 */
#define  WWDG_CFR_W3                         ((uint16_t)0x0008)            /*!< Bit 3 */
#define  WWDG_CFR_W4                         ((uint16_t)0x0010)            /*!< Bit 4 */
#define  WWDG_CFR_W5                         ((uint16_t)0x0020)            /*!< Bit 5 */
#define  WWDG_CFR_W6                         ((uint16_t)0x0040)            /*!< Bit 6 */

#define  WWDG_CFR_WDGTB                      ((uint16_t)0x0180)            /*!< WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFR_WDGTB0                     ((uint16_t)0x0080)            /*!< Bit 0 */
#define  WWDG_CFR_WDGTB1                     ((uint16_t)0x0100)            /*!< Bit 1 */

#define  WWDG_CFR_EWI                        ((uint16_t)0x0200)            /*!< Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_SR register  ********************/
#define  WWDG_SR_EWIF                        ((uint8_t)0x01)               /*!< Early Wakeup Interrupt Flag */

/*******************  Peripheral enable/disable macro like functions  ********************/

/* GPIOx clock enable */
#define GPIOA_PCLK_EN() (RCC->AHBENR |= (1u << 17u))
#define GPIOB_PCLK_EN() (RCC->AHBENR |= (1u << 18u))
#define GPIOC_PCLK_EN() (RCC->AHBENR |= (1u << 19u))
#define GPIOD_PCLK_EN() (RCC->AHBENR |= (1u << 20u))
#define GPIOE_PCLK_EN() (RCC->AHBENR |= (1u << 21u))
#define GPIOF_PCLK_EN() (RCC->AHBENR |= (1u << 22u))

/* Clock enable macros for I2Cx peripherals */
#define I2C1_PCLK_EN() (RCC->APB1ENR |= (1u << 21u))
#define I2C2_PCLK_EN() (RCC->APB1ENR |= (1u << 22u))

/* Clock enable macros for SPIx peripherals */
#define SPI1_PCLK_EN() (RCC->APB2ENR |= (1u << 12u))
#define SPI2_PCLK_EN() (RCC->APB1ENR |= (1u << 14u))

/* Clock enable macros for USARTx peripherals */
#define USART1_PLCK_EN() (RCC->APB2ENR |= (1u << 14u))
#define USART2_PLCK_EN() (RCC->APB1ENR |= (1u << 17u))
#define USART3_PLCK_EN() (RCC->APB1ENR |= (1u << 18u))
#define USART4_PLCK_EN() (RCC->APB1ENR |= (1u << 19u))
#define USART5_PLCK_EN() (RCC->APB1ENR |= (1u << 20u))
#define USART6_PLCK_EN() (RCC->APB2ENR |= (1u << 5u))
#define USART7_PLCK_EN() (RCC->APB2ENR |= (1u << 6u))
#define USART8_PLCK_EN() (RCC->APB2ENR |= (1u << 7u))

/* Clock enable macros for SYSCFG peripheral */
#define SYSCFG_PLCK_EN() (RCC->APB2ENR |= (1u << 0))

/* Clock disable macros for GPIOx peripherals */
#define GPIOA_PCLK_DI() (RCC->AHBRSTR &= ~(1u << 17u))
#define GPIOB_PCLK_DI() (RCC->AHBRSTR &= ~(1u << 18u))
#define GPIOC_PCLK_DI() (RCC->AHBRSTR &= ~(1u << 19u))
#define GPIOD_PCLK_DI() (RCC->AHBRSTR &= ~(1u << 20u))
#define GPIOE_PCLK_DI() (RCC->AHBRSTR &= ~(1u << 21u))
#define GPIOF_PCLK_DI() (RCC->AHBRSTR &= ~(1u << 22u))

/* Clock disable macros for I2Cx peripherals */
#define I2C1_PCLK_DI() (RCC->APB1RSTR &= ~(1u << 21u))
#define I2C2_PCLK_DI() (RCC->APB1RSTR &= ~(1u << 22u))

/* Clock disable macros for SPIx peripherals */
#define SPI1_PCLK_DI() (RCC->APB2RSTR &= ~(1u << 12u))
#define SPI2_PCLK_DI() (RCC->APB1RSTR &= ~(1u << 14u))

/* Clock disable macros for USARTx peripherals */
#define USART1_PLCK_DI() (RCC->APB2RSTR &= ~(1u << 14u))
#define USART2_PLCK_DI() (RCC->APB1RSTR &= ~(1u << 17u))
#define USART3_PLCK_DI() (RCC->APB1RSTR &= ~(1u << 18u))
#define USART4_PLCK_DI() (RCC->APB1RSTR &= ~(1u << 19u))
#define USART5_PLCK_DI() (RCC->APB1RSTR &= ~(1u << 20u))
#define USART6_PLCK_DI() (RCC->APB2RSTR &= ~(1u << 5u))
#define USART7_PLCK_DI() (RCC->APB2RSTR &= ~(1u << 6u))
#define USART8_PLCK_DI() (RCC->APB2RSTR &= ~(1u << 7u))

/* Clock disable macros for SYSCFG peripheral */
#define SYSCFG_PLCK_DI() (RCC->APB2RSTR &= ~(1u << 0))

/**
  * @}
  */

 /**
  * @}
  */

#ifdef USE_STDPERIPH_DRIVER
  #include "stm32f0xx_conf.h"
#endif

/** @addtogroup Exported_macro
  * @{
  */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F0XX_H */

/**
  * @}
  */

  /**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

